if OS.mac?
  cask '1password'
  cask '1password-cli'
  cask_args appdir: '/Applications'
end

# Shared CLI and development tooling.
brew 'aws-sso-cli'
brew 'certifi'
brew 'coreutils'
brew 'curl'
brew 'cython'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'findutils'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'helix'
brew 'jq'
brew 'jpeg-turbo'
brew 'libffi'
brew 'libpq'
brew 'libtiff'
brew 'libxml2'
brew 'libxslt'
brew 'libzip'
brew 'lua'
brew 'make'
brew 'mergiraf'
brew 'node'
brew 'openblas'
brew 'openssl@3'
brew 'pkgconf'
brew 'pipx'
brew 'pstree'
brew 'pyright'
brew 'ripgrep'
brew 'scc'
brew 'shellcheck'
brew 'zellij'
brew 'tree'
brew 'uv'
brew 'wget'
# brew 'yazi'
# brew 'yt-dlp'
# brew 'zoxide'

cask 'claude-code'
cask 'codex'

if OS.mac?
  cask 'brave-browser'
  cask 'chatgpt'
  cask 'dash'
  # cask 'dbeaver-community'
  # cask 'ghostty'
  # cask 'google-chrome'
  cask 'kdiff3'
  cask 'keepassxc'
  cask 'macpass'
  cask 'notion'
  # cask 'rustdesk'
  cask 'slack'
  # cask 'visual-studio-code'
  cask 'wezterm'
  cask 'zed'
  cask 'zoom'
end

if OS.linux?
  flatpak 'com.slack.Slack'
  flatpak 'org.chromium.Chromium'
  flatpak 'org.keepassxc.KeePassXC'
end

# macOS-only Docker Desktop alternative.
if OS.mac?
  brew 'colima'
end

# AI
# brew 'aider'
# brew 'ollama'
# cask 'cursor'

# Android development
# brew 'gradle'
# cask 'android-platform-tools'
# cask 'android-studio'
