cask_args appdir: '/Applications'

brew 'coreutils'
brew 'direnv'
brew 'findutils'
brew 'fswatch'
brew 'git'
brew 'gnu-sed'
brew 'grep'
brew 'make'
brew 'pstree'
brew 'rg'
brew 'scc'
brew 'tree'
brew 'wget'
brew 'yt-dlp'

cask '1password'
cask 'brave-browser'
cask 'dash'
cask 'dropbox'
cask 'iterm2'
cask 'macpass'
cask 'notion'
cask 'slack'
cask 'visual-studio-code'
cask 'zed'
cask 'zoom'

# AI
brew 'aider'
brew 'ollama'
cask 'chatgpt'
cask 'cursor'
cask 'windsurf'

# docker
brew 'docker'
brew 'docker-buildx' # TODO: symlink ~/.docker/config.json with the caveat from `brew info docker-buildx`
brew 'docker-compose'
brew 'colima' # Docker Desktop replacement

# Frontend
brew 'npm'

# Android development
brew 'gradle'
cask 'android-platform-tools'
cask 'android-studio'

# PostgreSQL
cask 'dbeaver-community'


