cask_args appdir: '/Applications'

brew 'coreutils'
brew 'direnv'
brew 'findutils'
brew 'fswatch'
brew 'fzf'
brew 'git'
brew 'mergiraf'
brew 'gnu-sed'
brew 'grep'
brew 'make'
brew 'pstree'
brew 'rg'
brew 'scc'
brew 'tree'
brew 'wget'
# brew 'yazi'
# brew 'yt-dlp'
# brew 'zoxide'

cask '1password'
cask '1password-cli'
cask 'brave-browser'
cask 'dash'
cask 'dropbox'
# cask 'iterm2'
# cask 'ghostty'
cask 'wezterm'
cask 'macpass'
cask 'notion'
# cask 'rustdesk'
cask 'slack'
# cask 'visual-studio-code'
cask 'zed'
cask 'zoom'
cask 'kdiff3'

# Python
brew 'pyright'
brew 'pipx' # to install pips globally

# AI
# brew 'aider'
# brew 'ollama'
cask 'codex'
cask 'chatgpt'
cask 'claude-code'
# cask 'cursor'

# docker
brew 'docker'
brew 'docker-buildx' # TODO: symlink ~/.docker/config.json with the caveat from `brew info docker-buildx`
brew 'docker-compose'
brew 'colima' # Docker Desktop replacement

# Frontend
brew 'npm'

# Android development
# brew 'gradle'
# cask 'android-platform-tools'
# cask 'android-studio'

# PostgreSQL
cask 'dbeaver-community'


